{
  "add_prefix_space": false,
  "added_tokens_decoder": {
    "50256": {
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  },
  "additional_special_tokens": [
    "<|endoftext|>"
  ],
  "bos_token": "<|endoftext|>",
  "clean_up_tokenization_spaces": true,
  "eos_token": "<|endoftext|>",
  "errors": "replace",
  "model_max_length": 1024,
  "pad_token": null,
  "sp_model_kwargs": {},
  "tokenizer_class": "GPT2Tokenizer",
  "unk_token": null
}
